una1veritas/Workspace/STM32-E_revB1_demo/Project/Test/arm/inc/NXP/iolpc4320_m0.h
/***************************************************************************
 **
 **    This file defines the Special Function Registers for
 **    NXP LPC4320 Cortex-M0 Core
 **
 **    Used with ARM IAR C/C++ Compiler and Assembler.
 **
 **    (c) Copyright IAR Systems 2012
 **
 **    $Revision: 50467 $
 **
 **    Note: Only little endian addressing of 8 bit registers.
 ***************************************************************************/

#ifndef __IOLPC4320_M0_H
#define __IOLPC4320_M0_H

#if (((__TID__ >> 8) & 0x7F) != 0x4F)     /* 0x4F = 79 dec */
#error This file should only be compiled by ARM IAR compiler and assembler
#endif

#include "io_macros.h"

/***************************************************************************
 ***************************************************************************
 **
 **    LPC4320_M0 SPECIAL FUNCTION REGISTERS
 **
 ***************************************************************************
 ***************************************************************************
 ***************************************************************************/

/* C-compiler specific declarations  ***************************************/
#ifdef __IAR_SYSTEMS_ICC__

#ifndef _SYSTEM_BUILD
#pragma system_include
#endif

#if __LITTLE_ENDIAN__ == 0
#error This file should only be compiled in little endian mode
#endif

/* SysTick Control and Status Register */
typedef struct {
  __REG32  ENABLE         : 1;
  __REG32  TICKINT        : 1;
  __REG32  CLKSOURCE      : 1;
  __REG32                 :13;
  __REG32  COUNTFLAG      : 1;
  __REG32                 :15;
} __syst_csr_bits;

/* SysTick Reload Value Register */
typedef struct {
  __REG32  RELOAD         :24;
  __REG32                 : 8;
} __syst_rvr_bits;

/* SysTick Current Value Register */
typedef struct {
  __REG32  CURRENT        :24;
  __REG32                 : 8;
} __syst_cvr_bits;

/* SysTick Calibration Value Register */
typedef struct {
  __REG32  TENMS          :24;
  __REG32                 : 6;
  __REG32  SKEW           : 1;
  __REG32  NOREF          : 1;
} __syst_calvr_bits;


/* Interrupt Set-Enable Registers 0-31 */
typedef struct {
  __REG32  ISE0        : 1;
  __REG32  ISE1        : 1;
  __REG32  ISE2        : 1;
  __REG32  ISE3        : 1;
  __REG32  ISE4        : 1;
  __REG32  ISE5        : 1;
  __REG32  ISE6        : 1;
  __REG32  ISE7        : 1;
  __REG32  ISE8        : 1;
  __REG32  ISE9        : 1;
  __REG32  ISE10       : 1;
  __REG32  ISE11       : 1;
  __REG32  ISE12       : 1;
  __REG32  ISE13       : 1;
  __REG32  ISE14       : 1;
  __REG32  ISE15       : 1;
  __REG32  ISE16       : 1;
  __REG32  ISE17       : 1;
  __REG32  ISE18       : 1;
  __REG32  ISE19       : 1;
  __REG32  ISE20       : 1;
  __REG32  ISE21       : 1;
  __REG32  ISE22       : 1;
  __REG32  ISE23       : 1;
  __REG32  ISE24       : 1;
  __REG32  ISE25       : 1;
  __REG32  ISE26       : 1;
  __REG32  ISE27       : 1;
  __REG32  ISE28       : 1;
  __REG32  ISE29       : 1;
  __REG32  ISE30       : 1;
  __REG32  ISE31       : 1;
} __nvic_iser_bits;

/* Interrupt Clear-Enable Registers 0-31 */
typedef struct {
  __REG32  ICE0        : 1;
  __REG32  ICE1        : 1;
  __REG32  ICE2        : 1;
  __REG32  ICE3        : 1;
  __REG32  ICE4        : 1;
  __REG32  ICE5        : 1;
  __REG32  ICE6        : 1;
  __REG32  ICE7        : 1;
  __REG32  ICE8        : 1;
  __REG32  ICE9        : 1;
  __REG32  ICE10       : 1;
  __REG32  ICE11       : 1;
  __REG32  ICE12       : 1;
  __REG32  ICE13       : 1;
  __REG32  ICE14       : 1;
  __REG32  ICE15       : 1;
  __REG32  ICE16       : 1;
  __REG32  ICE17       : 1;
  __REG32  ICE18       : 1;
  __REG32  ICE19       : 1;
  __REG32  ICE20       : 1;
  __REG32  ICE21       : 1;
  __REG32  ICE22       : 1;
  __REG32  ICE23       : 1;
  __REG32  ICE24       : 1;
  __REG32  ICE25       : 1;
  __REG32  ICE26       : 1;
  __REG32  ICE27       : 1;
  __REG32  ICE28       : 1;
  __REG32  ICE29       : 1;
  __REG32  ICE30       : 1;
  __REG32  ICE31       : 1;
} __nvic_icer_bits;

/* Interrupt Set-Pending Register 0-31 */
typedef struct {
  __REG32  ISP0        : 1;
  __REG32  ISP1        : 1;
  __REG32  ISP2        : 1;
  __REG32  ISP3        : 1;
  __REG32  ISP4        : 1;
  __REG32  ISP5        : 1;
  __REG32  ISP6        : 1;
  __REG32  ISP7        : 1;
  __REG32  ISP8        : 1;
  __REG32  ISP9        : 1;
  __REG32  ISP10       : 1;
  __REG32  ISP11       : 1;
  __REG32  ISP12       : 1;
  __REG32  ISP13       : 1;
  __REG32  ISP14       : 1;
  __REG32  ISP15       : 1;
  __REG32  ISP16       : 1;
  __REG32  ISP17       : 1;
  __REG32  ISP18       : 1;
  __REG32  ISP19       : 1;
  __REG32  ISP20       : 1;
  __REG32  ISP21       : 1;
  __REG32  ISP22       : 1;
  __REG32  ISP23       : 1;
  __REG32  ISP24       : 1;
  __REG32  ISP25       : 1;
  __REG32  ISP26       : 1;
  __REG32  ISP27       : 1;
  __REG32  ISP28       : 1;
  __REG32  ISP29       : 1;
  __REG32  ISP30       : 1;
  __REG32  ISP31       : 1;
} __nvic_ispr_bits;

/* Interrupt Clear-Pending Register 0-31 */
typedef struct {
  __REG32  ICP0        : 1;
  __REG32  ICP1        : 1;
  __REG32  ICP2        : 1;
  __REG32  ICP3        : 1;
  __REG32  ICP4        : 1;
  __REG32  ICP5        : 1;
  __REG32  ICP6        : 1;
  __REG32  ICP7        : 1;
  __REG32  ICP8        : 1;
  __REG32  ICP9        : 1;
  __REG32  ICP10       : 1;
  __REG32  ICP11       : 1;
  __REG32  ICP12       : 1;
  __REG32  ICP13       : 1;
  __REG32  ICP14       : 1;
  __REG32  ICP15       : 1;
  __REG32  ICP16       : 1;
  __REG32  ICP17       : 1;
  __REG32  ICP18       : 1;
  __REG32  ICP19       : 1;
  __REG32  ICP20       : 1;
  __REG32  ICP21       : 1;
  __REG32  ICP22       : 1;
  __REG32  ICP23       : 1;
  __REG32  ICP24       : 1;
  __REG32  ICP25       : 1;
  __REG32  ICP26       : 1;
  __REG32  ICP27       : 1;
  __REG32  ICP28       : 1;
  __REG32  ICP29       : 1;
  __REG32  ICP30       : 1;
  __REG32  ICP31       : 1;
} __nvic_icpr_bits;

/* Interrupt Priority Registers 0-3 */
typedef struct {
  __REG32  IP0            : 8;
  __REG32  IP1            : 8;
  __REG32  IP2            : 8;
  __REG32  IP3            : 8;
} __nvic_ipr0_bits;

