una1veritas/Workspace/STM32-E_revB1_demo/Project/Test/arm/inc/NXP/iolpc4320_m0.h
/* Port Status and Control register (PORTSC1) */
typedef struct{
__REG32 CCS             : 1;
__REG32 CSC             : 1;
__REG32 PE              : 1;
__REG32 PEC             : 1;
__REG32 OCA             : 1;
__REG32 OCC             : 1;
__REG32 FPR             : 1;
__REG32 SUSP            : 1;
__REG32 PR              : 1;
__REG32 HSP             : 1;
__REG32 LS              : 2;
__REG32 PP              : 1;
__REG32                 : 1;
__REG32 PIC1_0          : 2;
__REG32 PTC3_0          : 4;
__REG32 WKCN            : 1;
__REG32 WKDC            : 1;
__REG32 WKOC            : 1;
__REG32 PHCD            : 1;
__REG32 PFSC            : 1;
__REG32                 : 1;
__REG32 PSPD            : 2;
__REG32                 : 4;
} __usb_portsc1_reg_bits;

/* OTG Status and Control register (OTGSC) */
typedef struct{
__REG32 VD              : 1;
__REG32 VC              : 1;
__REG32 HAAR            : 1;
__REG32 OT              : 1;
__REG32 DP              : 1;
__REG32 IDPU            : 1;
__REG32 HADP            : 1;
__REG32 HABA            : 1;
__REG32 ID              : 1;
__REG32 AVV             : 1;
__REG32 ASV             : 1;
__REG32 BSV             : 1;
__REG32 BSE             : 1;
__REG32 MS1T            : 1;
__REG32 DPS             : 1;
__REG32                 : 1;
__REG32 IDIS            : 1;
__REG32 AVVIS           : 1;
__REG32 ASVIS           : 1;
__REG32 BSVIS           : 1;
__REG32 BSEIS           : 1;
__REG32 ms1S            : 1;
__REG32 DPIS            : 1;
__REG32                 : 1;
__REG32 IDIE            : 1;
__REG32 AVVIE           : 1;
__REG32 ASVIE           : 1;
__REG32 BSVIE           : 1;
__REG32 BSEIE           : 1;
__REG32 MS1E            : 1;
__REG32 DPIE            : 1;
__REG32                 : 1;
} __usb_otgsc_reg_bits;

/* USB Mode register (USBMODE) */
typedef struct{
__REG32 CM1_0           : 2;
__REG32 ES              : 1;
__REG32 SLOM            : 1;
__REG32 SDIS            : 1;
__REG32 VBPS            : 1;
__REG32                 :26;
} __usb_usbmode_reg_bits;

/* USB Endpoint Setup Status register (ENDPSETUPSTAT) */
typedef union {
  struct{
  __REG32 ENDPT0SETUPSTAT : 1;
  __REG32 ENDPT1SETUPSTAT : 1;
  __REG32 ENDPT2SETUPSTAT : 1;
  __REG32 ENDPT3SETUPSTAT : 1;
  __REG32 ENDPT4SETUPSTAT : 1;
  __REG32 ENDPT5SETUPSTAT : 1;
  __REG32                 :26;
  };
  /* USB0_ENDPTSETUPSTAT */
  struct{
  __REG32 ENDPTSETUPSTAT0 : 1;
  __REG32 ENDPTSETUPSTAT1 : 1;
  __REG32 ENDPTSETUPSTAT2 : 1;
  __REG32 ENDPTSETUPSTAT3 : 1;
  __REG32 ENDPTSETUPSTAT4 : 1;
  __REG32 ENDPTSETUPSTAT5 : 1;
  __REG32                 :26;
  };
} __usb_endptsetupstat_reg_bits;

/* USB Endpoint Prime register (ENDPTPRIME) */
typedef struct{
__REG32 PERB0           : 1;
__REG32 PERB1           : 1;
__REG32 PERB2           : 1;
__REG32 PERB3           : 1;
__REG32 PERB4           : 1;
__REG32 PERB5           : 1;
__REG32                 :10;
__REG32 PETB0           : 1;
__REG32 PETB1           : 1;
__REG32 PETB2           : 1;
__REG32 PETB3           : 1;
__REG32 PETB4           : 1;
__REG32 PETB5           : 1;
__REG32                 :10;
} __usb_endptprime_reg_bits;

/* USB Endpoint Flush register (ENDPTFLUSH) */
typedef struct{
__REG32 FERB0           : 1;
__REG32 FERB1           : 1;
__REG32 FERB2           : 1;
__REG32 FERB3           : 1;
__REG32 FERB4           : 1;
__REG32 FERB5           : 1;
__REG32                 :10;
__REG32 FETB0           : 1;
__REG32 FETB1           : 1;
__REG32 FETB2           : 1;
__REG32 FETB3           : 1;
__REG32 FETB4           : 1;
__REG32 FETB5           : 1;
__REG32                 :10;
} __usb_endptflush_reg_bits;

/* USB Endpoint Status register (ENDPSTAT) */
typedef struct{
__REG32 ERBR0           : 1;
__REG32 ERBR1           : 1;
__REG32 ERBR2           : 1;
__REG32 ERBR3           : 1;
__REG32 ERBR4           : 1;
__REG32 ERBR5           : 1;
__REG32                 :10;
__REG32 ETBR0           : 1;
__REG32 ETBR1           : 1;
__REG32 ETBR2           : 1;
__REG32 ETBR3           : 1;
__REG32 ETBR4           : 1;
__REG32 ETBR5           : 1;
__REG32                 :10;
} __usb_endptstatus_reg_bits;

/* USB Endpoint Complete register (ENDPTCOMPLETE) */
typedef struct{
__REG32 ERCE0           : 1;
__REG32 ERCE1           : 1;
__REG32 ERCE2           : 1;
__REG32 ERCE3           : 1;
__REG32 ERCE4           : 1;
__REG32 ERCE5           : 1;
__REG32                 :10;
__REG32 ETCE0           : 1;
__REG32 ETCE1           : 1;
__REG32 ETCE2           : 1;
__REG32 ETCE3           : 1;
__REG32 ETCE4           : 1;
__REG32 ETCE5           : 1;
__REG32                 :10;
} __usb_endptcomplete_reg_bits;

/* USB Endpoint 0 Control register (ENDPTCTRL0) */
typedef struct{
__REG32 RXS             : 1;
__REG32                 : 1;
__REG32 RXT1_0          : 2;
__REG32                 : 3;
__REG32 RXE             : 1;
__REG32                 : 8;
__REG32 TXS             : 1;
__REG32                 : 1;
__REG32 TXT1_0          : 2;
__REG32                 : 3;
__REG32 TXE             : 1;
__REG32                 : 8;
} __usb_endptctrl0_reg_bits;

/* Endpoint 1 to 5 control registers */
typedef struct{
__REG32 RXS             : 1;
__REG32                 : 1;
__REG32 RXT             : 2;
__REG32                 : 1;
__REG32 RXI             : 1;
__REG32 RXR             : 1;
__REG32 RXE             : 1;
__REG32                 : 8;
__REG32 TXS             : 1;
__REG32                 : 1;
__REG32 TXT1_0          : 2;
__REG32                 : 1;
__REG32 TXI             : 1;
__REG32 TXR             : 1;
__REG32 TXE             : 1;
__REG32                 : 8;
} __usb_endptctrl_reg_bits;


/* SCT configuration register */
typedef struct{
__REG32 UNIFY                 : 1;
__REG32 CLKMODE               : 2;
__REG32 CLKSEL                : 4;
__REG32 NORELAODL_NORELOADU   : 1;
__REG32 NORELOADH             : 1;
__REG32 INSYNC0               : 1;
__REG32 INSYNC1               : 1;
__REG32 INSYNC2               : 1;
__REG32 INSYNC3               : 1;
__REG32 INSYNC4               : 1;
__REG32 INSYNC5               : 1;
__REG32 INSYNC6               : 1;
__REG32 INSYNC7               : 1;
__REG32                       :15;
} __sct_config_bits;

/* SCT control register */
typedef union{
  /* SCT_CTRL */
  struct{
  __REG32 DOWN_L                : 1;
  __REG32 STOP_L                : 1;
  __REG32 HALT_L                : 1;
  __REG32 CLRCTR_L              : 1;
  __REG32 BIDIR_L               : 1;
  __REG32 PRE_L                 : 8;
  __REG32                       : 3;
  __REG32 DOWN_H                : 1;
  __REG32 STOP_H                : 1;
  __REG32 HALT_H                : 1;
  __REG32 CLRCTR_H              : 1;
  __REG32 BIDIR_H               : 1;
  __REG32 PRE_H                 : 8;
  __REG32                       : 3;
  };

  struct{
    union{
      /* SCT_CTRL_L */
      struct{
      __REG16 DOWN_L                : 1;
      __REG16 STOP_L                : 1;
      __REG16 HALT_L                : 1;
      __REG16 CLRCTR_L              : 1;
      __REG16 BIDIR_L               : 1;
      __REG16 PRE_L                 : 8;
      __REG16                       : 3;
      } __sct_ctrl_l_bits;
      __REG16 __sct_ctrl_l;
    };
    union{
      /* SCT_CTRL_H */
      struct{
      __REG16 DOWN_H                : 1;
      __REG16 STOP_H                : 1;
      __REG16 HALT_H                : 1;
      __REG16 CLRCTR_H              : 1;
      __REG16 BIDIR_H               : 1;
      __REG16 PRE_H                 : 8;
      __REG16                       : 3;
      } __sct_ctrl_h_bits;
      __REG16 __sct_ctrl_h;
    };
  };
} __sct_ctrl_bits;


/* SCT limit register */
typedef union{
  /* SCT_LIMIT */
  struct{
  __REG32 LIMMSK0_L             : 1;
  __REG32 LIMMSK1_L             : 1;
  __REG32 LIMMSK2_L             : 1;
  __REG32 LIMMSK3_L             : 1;
  __REG32 LIMMSK4_L             : 1;
  __REG32 LIMMSK5_L             : 1;
  __REG32 LIMMSK6_L             : 1;
  __REG32 LIMMSK7_L             : 1;
  __REG32 LIMMSK8_L             : 1;
  __REG32 LIMMSK9_L             : 1;
  __REG32 LIMMSK10_L            : 1;
  __REG32 LIMMSK11_L            : 1;
  __REG32 LIMMSK12_L            : 1;
  __REG32 LIMMSK13_L            : 1;
  __REG32 LIMMSK14_L            : 1;
  __REG32 LIMMSK15_L            : 1;
  __REG32 LIMMSK0_H             : 1;
  __REG32 LIMMSK1_H             : 1;
  __REG32 LIMMSK2_H             : 1;
  __REG32 LIMMSK3_H             : 1;
  __REG32 LIMMSK4_H             : 1;
  __REG32 LIMMSK5_H             : 1;
  __REG32 LIMMSK6_H             : 1;
  __REG32 LIMMSK7_H             : 1;
  __REG32 LIMMSK8_H             : 1;
  __REG32 LIMMSK9_H             : 1;
  __REG32 LIMMSK10_H            : 1;
  __REG32 LIMMSK11_H            : 1;
  __REG32 LIMMSK12_H            : 1;
  __REG32 LIMMSK13_H            : 1;
  __REG32 LIMMSK14_H            : 1;
  __REG32 LIMMSK15_H            : 1;
  };

  struct{
    union{
      /* SCT_LIMIT_L */
      struct{
      __REG16 LIMMSK0_L             : 1;
      __REG16 LIMMSK1_L             : 1;
      __REG16 LIMMSK2_L             : 1;
      __REG16 LIMMSK3_L             : 1;
      __REG16 LIMMSK4_L             : 1;
      __REG16 LIMMSK5_L             : 1;
      __REG16 LIMMSK6_L             : 1;
      __REG16 LIMMSK7_L             : 1;
      __REG16 LIMMSK8_L             : 1;
      __REG16 LIMMSK9_L             : 1;
      __REG16 LIMMSK10_L            : 1;
      __REG16 LIMMSK11_L            : 1;
      __REG16 LIMMSK12_L            : 1;
      __REG16 LIMMSK13_L            : 1;
      __REG16 LIMMSK14_L            : 1;
      __REG16 LIMMSK15_L            : 1;
      } __sct_limit_l_bits;
      __REG16 __sct_limit_l;
    };
    union{
      /* SCT_LIMIT_H */
      struct{
      __REG16 LIMMSK0_H             : 1;
      __REG16 LIMMSK1_H             : 1;
      __REG16 LIMMSK2_H             : 1;
      __REG16 LIMMSK3_H             : 1;
      __REG16 LIMMSK4_H             : 1;
      __REG16 LIMMSK5_H             : 1;
      __REG16 LIMMSK6_H             : 1;
      __REG16 LIMMSK7_H             : 1;
      __REG16 LIMMSK8_H             : 1;
      __REG16 LIMMSK9_H             : 1;
      __REG16 LIMMSK10_H            : 1;
      __REG16 LIMMSK11_H            : 1;
      __REG16 LIMMSK12_H            : 1;
      __REG16 LIMMSK13_H            : 1;
      __REG16 LIMMSK14_H            : 1;
      __REG16 LIMMSK15_H            : 1;
      } __sct_limit_h_bits;
      __REG16 __sct_limit_h;
    };
  };
} __sct_limit_bits;

