una1veritas/Workspace/STM32-E_revB1_demo/Project/Test/arm/inc/NXP/iolpc4320_m0.h
/* SCT output clear registers */
typedef struct{
__REG32 CLR0                  : 1;
__REG32 CLR1                  : 1;
__REG32 CLR2                  : 1;
__REG32 CLR3                  : 1;
__REG32 CLR4                  : 1;
__REG32 CLR5                  : 1;
__REG32 CLR6                  : 1;
__REG32 CLR7                  : 1;
__REG32 CLR8                  : 1;
__REG32 CLR9                  : 1;
__REG32 CLR10                 : 1;
__REG32 CLR11                 : 1;
__REG32 CLR12                 : 1;
__REG32 CLR13                 : 1;
__REG32 CLR14                 : 1;
__REG32 CLR15                 : 1;
__REG32                       :16;
} __sct_outputcl_bits;


/* TIMER interrupt register */
typedef struct{
__REG32 MR0INT  : 1;
__REG32 MR1INT  : 1;
__REG32 MR2INT  : 1;
__REG32 MR3INT  : 1;
__REG32 CR0INT  : 1;
__REG32 CR1INT  : 1;
__REG32 CR2INT  : 1;
__REG32 CR3INT  : 1;
__REG32         :24;
} __tmr_ir_bits;

/* TIMER control register */
typedef struct{
__REG32 CEN  : 1;
__REG32 CRST : 1;
__REG32      :30;
} __tmr_tcr_bits;

/* TIMER count control register */
typedef struct{
__REG32 CTMODE : 2;     /*Counter/Timer Mode*/
__REG32 CINSEL : 2;     /*Count Input Select*/
__REG32        :28;
} __tmr_ctcr_bits;

/* TIMER match control register */
typedef struct{
__REG32 MR0I     : 1;
__REG32 MR0R     : 1;
__REG32 MR0S     : 1;
__REG32 MR1I     : 1;
__REG32 MR1R     : 1;
__REG32 MR1S     : 1;
__REG32 MR2I     : 1;
__REG32 MR2R     : 1;
__REG32 MR2S     : 1;
__REG32 MR3I     : 1;
__REG32 MR3R     : 1;
__REG32 MR3S     : 1;
__REG32          :20;
} __tmr_mcr_bits;

/* TIMER capture control register */
typedef struct{
__REG32 CAP0RE   : 1;
__REG32 CAP0FE   : 1;
__REG32 CAP0I    : 1;
__REG32 CAP1RE   : 1;
__REG32 CAP1FE   : 1;
__REG32 CAP1I    : 1;
__REG32 CAP2RE   : 1;
__REG32 CAP2FE   : 1;
__REG32 CAP2I    : 1;
__REG32 CAP3RE   : 1;
__REG32 CAP3FE   : 1;
__REG32 CAP3I    : 1;
__REG32          :20;
} __tmr_tccr_bits;

/* TIMER external match register */
typedef struct{
__REG32 EM0   : 1;
__REG32 EM1   : 1;
__REG32 EM2   : 1;
__REG32 EM3   : 1;
__REG32 EMC0  : 2;
__REG32 EMC1  : 2;
__REG32 EMC2  : 2;
__REG32 EMC3  : 2;
__REG32       :20;
} __tmr_emr_bits;


/* MCPWM Control read  */
typedef struct{
__REG32 RUN0    : 1;
__REG32 CENTER0 : 1;
__REG32 POLA0   : 1;
__REG32 DTE0    : 1;
__REG32 DISUP0  : 1;
__REG32         : 3;
__REG32 RUN1    : 1;
__REG32 CENTER1 : 1;
__REG32 POLA1   : 1;
__REG32 DTE1    : 1;
__REG32 DISUP1  : 1;
__REG32         : 3;
__REG32 RUN2    : 1;
__REG32 CENTER2 : 1;
__REG32 POLA2   : 1;
__REG32 DTE2    : 1;
__REG32 DISUP2  : 1;
__REG32         : 8;
__REG32 INVBDC  : 1;
__REG32 ACMODE  : 1;
__REG32 DCMODE  : 1;
} __mc_con_bits;

/* MCPWM Control set  */

#define MC_CON_SET_RUN0_SET       (0x00000001UL)
#define MC_CON_SET_CENTER0_SET    (0x00000002UL)
#define MC_CON_SET_POLA0_SET      (0x00000004UL)
#define MC_CON_SET_DTE0_SET       (0x00000008UL)
#define MC_CON_SET_DISUP0_SET     (0x00000010UL)

#define MC_CON_SET_RUN1_SET       (0x00000100UL)
#define MC_CON_SET_CENTER1_SET    (0x00000200UL)
#define MC_CON_SET_POLA1_SET      (0x00000400UL)
#define MC_CON_SET_DTE1_SET       (0x00000800UL)
#define MC_CON_SET_DISUP1_SET     (0x00001000UL)

#define MC_CON_SET_RUN2_SET       (0x00010000UL)
#define MC_CON_SET_CENTER2_SET    (0x00020000UL)
#define MC_CON_SET_POLA2_SET      (0x00040000UL)
#define MC_CON_SET_DTE2_SET       (0x00080000UL)
#define MC_CON_SET_DISUP2_SET     (0x00100000UL)

#define MC_CON_SET_INVBDC_SET     (0x20000000UL)
#define MC_CON_SET_ACMODE_SET     (0x40000000UL)
#define MC_CON_SET_DCMODE_SET     (0x80000000UL)

/* MCPWM Control clear  */

#define MC_CON_CLR_RUN0_CLR       (0x00000001UL)
#define MC_CON_CLR_CENTER0_CLR    (0x00000002UL)
#define MC_CON_CLR_POLA0_CLR      (0x00000004UL)
#define MC_CON_CLR_DTE0_CLR       (0x00000008UL)
#define MC_CON_CLR_DISUP0_CLR     (0x00000010UL)

#define MC_CON_CLR_RUN1_CLR       (0x00000100UL)
#define MC_CON_CLR_CENTER1_CLR    (0x00000200UL)
#define MC_CON_CLR_POLA1_CLR      (0x00000400UL)
#define MC_CON_CLR_DTE1_CLR       (0x00000800UL)
#define MC_CON_CLR_DISUP1_CLR     (0x00001000UL)

#define MC_CON_CLR_RUN2_CLR       (0x00010000UL)
#define MC_CON_CLR_CENTER2_CLR    (0x00020000UL)
#define MC_CON_CLR_POLA2_CLR      (0x00040000UL)
#define MC_CON_CLR_DTE2_CLR       (0x00080000UL)
#define MC_CON_CLR_DISUP2_CLR     (0x00100000UL)

#define MC_CON_CLR_INVBDC_CLR     (0x20000000UL)
#define MC_CON_CLR_ACMODE_CLR     (0x40000000UL)
#define MC_CON_CLR_DCMODE_CLR     (0x80000000UL)

/* MCPWM Capture control register */
typedef struct{
__REG32 CAP0MCI0_RE : 1;
__REG32 CAP0MCI0_FE : 1;
__REG32 CAP0MCI1_RE : 1;
__REG32 CAP0MCI1_FE : 1;
__REG32 CAP0MCI2_RE : 1;
__REG32 CAP0MCI2_FE : 1;
__REG32 CAP1MCI0_RE : 1;
__REG32 CAP1MCI0_FE : 1;
__REG32 CAP1MCI1_RE : 1;
__REG32 CAP1MCI1_FE : 1;
__REG32 CAP1MCI2_RE : 1;
__REG32 CAP1MCI2_FE : 1;
__REG32 CAP2MCI0_RE : 1;
__REG32 CAP2MCI0_FE : 1;
__REG32 CAP2MCI1_RE : 1;
__REG32 CAP2MCI1_FE : 1;
__REG32 CAP2MCI2_RE : 1;
__REG32 CAP2MCI2_FE : 1;
__REG32 RT0         : 1;
__REG32 RT1         : 1;
__REG32 RT2         : 1;
__REG32 HNFCAP0     : 1;
__REG32 HNFCAP1     : 1;
__REG32 HNFCAP2     : 1;
__REG32             : 8;
} __mc_capcon_bits;

/* MCPWM Capture Control set  */

#define MC_CAPCON_SET_CAP0MCI0_RE_SET    (0x00000001UL)
#define MC_CAPCON_SET_CAP0MCI0_FE_SET    (0x00000002UL)
#define MC_CAPCON_SET_CAP0MCI1_RE_SET    (0x00000004UL)
#define MC_CAPCON_SET_CAP0MCI1_FE_SET    (0x00000008UL)
#define MC_CAPCON_SET_CAP0MCI2_RE_SET    (0x00000010UL)
#define MC_CAPCON_SET_CAP0MCI2_FE_SET    (0x00000020UL)
#define MC_CAPCON_SET_CAP1MCI0_RE_SET    (0x00000040UL)
#define MC_CAPCON_SET_CAP1MCI0_FE_SET    (0x00000080UL)
#define MC_CAPCON_SET_CAP1MCI1_RE_SET    (0x00000100UL)
#define MC_CAPCON_SET_CAP1MCI1_FE_SET    (0x00000200UL)
#define MC_CAPCON_SET_CAP1MCI2_RE_SET    (0x00000400UL)
#define MC_CAPCON_SET_CAP1MCI2_FE_SET    (0x00000800UL)
#define MC_CAPCON_SET_CAP2MCI0_RE_SET    (0x00001000UL)
#define MC_CAPCON_SET_CAP2MCI0_FE_SET    (0x00002000UL)
#define MC_CAPCON_SET_CAP2MCI1_RE_SET    (0x00004000UL)
#define MC_CAPCON_SET_CAP2MCI1_FE_SET    (0x00008000UL)
#define MC_CAPCON_SET_CAP2MCI2_RE_SET    (0x00010000UL)
#define MC_CAPCON_SET_CAP2MCI2_FE_SET    (0x00020000UL)
#define MC_CAPCON_SET_RT0_SET            (0x00040000UL)
#define MC_CAPCON_SET_RT1_SET            (0x00080000UL)
#define MC_CAPCON_SET_RT2_SET            (0x00100000UL)
#define MC_CAPCON_SET_HNFCAP0_SET        (0x00200000UL)
#define MC_CAPCON_SET_HNFCAP1_SET        (0x00400000UL)
#define MC_CAPCON_SET_HNFCAP2_SET        (0x00800000UL)

/* MCPWM Capture control clear  */

