una1veritas/Workspace/STM32-E_revB1_demo/Project/Test/arm/inc/NXP/iolpc4320_m0.h
/* UART1 Scratch Pad Register */
typedef struct{
  __REG32 Pad             : 8;
  __REG32                 :24;
} __uart1_scr_bits;

/* UART1 Transmit Enable Register */
typedef struct{
  __REG32                 : 7;
  __REG32 TXEN            : 1;
  __REG32                 :24;
} __uart1_ter_bits;

/* UART Line Status Register (LSR) */
typedef struct {
__REG32 RDR             : 1;
__REG32 OE              : 1;
__REG32 PE              : 1;
__REG32 FE              : 1;
__REG32 BI              : 1;
__REG32 THRE            : 1;
__REG32 TEMT            : 1;
__REG32 RXFE            : 1;
__REG32 TXERR           : 1;
__REG32                 :23;
} __uart_lsr_bits;

/* UART1 Line Status Register (LSR) */
typedef struct {
__REG32 RDR             : 1;
__REG32 OE              : 1;
__REG32 PE              : 1;
__REG32 FE              : 1;
__REG32 BI              : 1;
__REG32 THRE            : 1;
__REG32 TEMT            : 1;
__REG32 RXFE            : 1;
__REG32                 :24;
} __uart1_lsr_bits;

/* UART Line Control Register (LCR) */
typedef struct {
__REG32 WLS   : 2;
__REG32 SBS   : 1;
__REG32 PE    : 1;
__REG32 PS    : 2;
__REG32 BC    : 1;
__REG32 DLAB  : 1;
__REG32       :24;
} __uart_lcr_bits;

/* UART interrupt identification register and fifo control register */
typedef union {
  /*UxIIR*/
  struct {
__REG32 INTSTATUS : 1;
__REG32 INTID     : 3;
__REG32           : 2;
__REG32 FIFOENABLE: 2;
__REG32 ABEOINT   : 1;
__REG32 ABTOINT   : 1;
__REG32           :22;
  };
  /*UxFCR*/
  struct {
__REG32 FIFOEN      : 1;
__REG32 RXFIFORES   : 1;
__REG32 TXFIFORES   : 1;
__REG32 DMAMODE     : 1;
__REG32             : 2;
__REG32 RXTRIGLVL   : 2;
__REG32             :24;
  };
} __uart_fcriir_bits;

/* UART modem control register */
typedef struct{
__REG32 DTRCTRL : 1;
__REG32 RTSCTRL : 1;
__REG32         : 2;
__REG32 LMS     : 1;
__REG32         : 1;
__REG32 RTSEN   : 1;
__REG32 CTSEN   : 1;
__REG32         :24;
} __uart1_mcr_bits;

/* UART modem status register */
typedef struct{
__REG32 DCTS  : 1;
__REG32 DDSR  : 1;
__REG32 TERI  : 1;
__REG32 DDCD  : 1;
__REG32 CTS   : 1;
__REG32 DSR   : 1;
__REG32 RI    : 1;
__REG32 DCD   : 1;
__REG32       :24;
} __uart1_msr_bits;

/* UART Auto-baud Control Register */
typedef struct{
__REG32 START        : 1;
__REG32 MODE         : 1;
__REG32 AUTORESTART  : 1;
__REG32              : 5;
__REG32 ABEOINTCLR   : 1;
__REG32 ABTOINTCLR   : 1;
__REG32              :22;
} __uart_acr_bits;

/* IrDA Control Register */
typedef struct{
__REG32 IRDAEN       : 1;
__REG32 IRDAINV      : 1;
__REG32 FIXPULSEEN   : 1;
__REG32 PULSEDIV     : 3;
__REG32              :26;
} __uart_icr_bits;

/* UART Fractional Divider Register */
typedef struct{
__REG32 DIVADDVAL  : 4;
__REG32 MULVAL     : 4;
__REG32            :24;
} __uart_fdr_bits;

/* UART Oversampling Register */
typedef struct{
__REG32            : 1;
__REG32 OSFRAC     : 3;
__REG32 OSINT      : 4;
__REG32 FDINT      : 7;
__REG32            :17;
} __uart_osr_bits;

/* UART RS485 Control register */
typedef struct{
__REG32 NMMEN      : 1;
__REG32 RXDIS      : 1;
__REG32 AADEN      : 1;
__REG32            : 1;
__REG32 DCTRL      : 1;
__REG32 OINV       : 1;
__REG32            :26;
} __uart_rs485ctrl_bits;

/* UART1 RS485 Control register */
typedef struct{
__REG32 NMMEN      : 1;
__REG32 RXDIS      : 1;
__REG32 AADEN      : 1;
__REG32 SEL        : 1;
__REG32 DCTRL      : 1;
__REG32 OINV       : 1;
__REG32            :26;
} __uart1_rs485ctrl_bits;

/* UART Half-duplex enable register */
typedef struct{
__REG32 HDEN       : 1;
__REG32            :31;
} __uart_hden_bits;

/* UART Smart card interface control register */
typedef struct{
__REG32 SCIEN      : 1;
__REG32 NACKDIS    : 1;
__REG32 PROTSEL    : 1;
__REG32            : 2;
__REG32 TXRETRY    : 3;
__REG32 GUARDTIME  : 8;
__REG32            :16;
} __uart_scictrl_bits;

/* UART Smart card interface control register */
typedef struct{
__REG32 SYNC              : 1;
__REG32 CSRC              : 1;
__REG32 FES               : 1;
__REG32 TSBYPASS          : 1;
__REG32 CSCEN             : 1;
__REG32 SSSDIS            : 1;
__REG32 CCCLR             : 1;
__REG32                   :25;
} __uart_syncctrl_bits;

/* UART FIFO Level register */
typedef struct{
__REG32 RXFIFILVL  : 4;
__REG32            : 4;
__REG32 TXFIFOLVL  : 4;
__REG32            :20;
} __uart1_fifolvl_bits;

/* UART RS485 Address Match register */
typedef struct{
__REG32 ADRMATCH   : 8;
__REG32            :24;
} __uart_rs485adrmatch_bits;

/* UART RS485 Delay value register */
typedef struct{
__REG32 DLY        : 8;
__REG32            :24;
} __uart_rs485dly_bits;


/* SSP Control Register 0 */
typedef struct{
__REG32 DSS  : 4;
__REG32 FRF  : 2;
__REG32 CPOL : 1;
__REG32 CPHA : 1;
__REG32 SCR  : 8;
__REG32      :16;
} __ssp_cr0_bits;

/* SSP Control Register 1 */
typedef struct{
__REG32 LBM  : 1;
__REG32 SSE  : 1;
__REG32 MS   : 1;
__REG32 SOD  : 1;
__REG32      :28;
} __ssp_cr1_bits;

/* SSP Data Register */
typedef struct{
__REG32 DATA :16;
__REG32      :16;
} __ssp_dr_bits;

/* SSP Status Register */
typedef struct{
__REG32 TFE  : 1;
__REG32 TNF  : 1;
__REG32 RNE  : 1;
__REG32 RFF  : 1;
__REG32 BSY  : 1;
__REG32      :27;
} __ssp_sr_bits;

/* SSP Clock Prescale Register */
typedef struct{
__REG32 CPSDVSR : 8;
__REG32         :24;
} __ssp_cpsr_bits;

/* SSP Interrupt Mask Set/Clear Register */
typedef struct{
__REG32 RORIM  : 1;
__REG32 RTIM   : 1;
__REG32 RXIM   : 1;
__REG32 TXIM   : 1;
__REG32        :28;
} __ssp_imsc_bits;

/* SSP Raw Interrupt Status Register */
typedef struct{
__REG32 RORRIS  : 1;
__REG32 RTRIS   : 1;
__REG32 RXRIS   : 1;
__REG32 TXRIS   : 1;
__REG32         :28;
} __ssp_ris_bits;

/* SSP Masked Interrupt Status Register */
typedef struct{
__REG32 RORMIS  : 1;
__REG32 RTMIS   : 1;
__REG32 RXMIS   : 1;
__REG32 TXMIS   : 1;
__REG32         :28;
} __ssp_mis_bits;

