una1veritas/Workspace/STM32-E_revB1_demo/Project/Test/arm/inc/NXP/iolpc4320_m0.h
/***************************************************************************
 **
 ** Alarm timer
 **
 ***************************************************************************/
__IO_REG32_BIT(AT_DOWNCOUNTER,         0x40040000,__READ_WRITE ,__at_downcounter_bits);
__IO_REG32_BIT(AT_PRESET,              0x40040004,__READ_WRITE ,__at_preset_bits);
__IO_REG32(    AT_CLR_EN,              0x40040FD8,__WRITE      );
__IO_REG32(    AT_SET_EN,              0x40040FDC,__WRITE      );
__IO_REG32_BIT(AT_STATUS,              0x40040FE0,__READ       ,__at_status_bits);
__IO_REG32_BIT(AT_ENABLE,              0x40040FE4,__READ       ,__at_enable_bits);
__IO_REG32(    AT_CLR_STAT,            0x40040FE8,__WRITE      );
__IO_REG32(    AT_SET_STAT,            0x40040FEC,__WRITE      );

/***************************************************************************
 **
 ** Watchdog
 **
 ***************************************************************************/
__IO_REG32_BIT(WDMOD,                  0x40080000,__READ_WRITE ,__wwdt_mod_bits);
#define WWDT_MOD         WDMOD
#define WWDT_MOD_bit     WDMOD_bit
__IO_REG32_BIT(WDTC,                   0x40080004,__READ_WRITE ,__wwdt_tc_bits);
#define WWDT_TC          WDTC
#define WWDT_TC_bit      WDTC_bit
__IO_REG32(    WDFEED,                 0x40080008,__WRITE      );
#define WWDT_FEED        WDFEED
__IO_REG32_BIT(WDTV,                   0x4008000C,__READ       ,__wwdt_tv_bits);
#define WWDT_TV          WDTV
#define WWDT_TV_bit      WDTV_bit
__IO_REG32_BIT(WDWARNINT,              0x40080014,__READ_WRITE ,__wwdt_warnint_bits);
#define WWDT_WARNINT     WDWARNINT
#define WWDT_WARNINT_bit WDWARNINT_bit
__IO_REG32_BIT(WDWINDOW,               0x40080018,__READ_WRITE ,__wwdt_window_bits);
#define WWDT_WINDOW      WDWINDOW
#define WWDT_WINDOW_bit  WDWINDOW_bit

/***************************************************************************
 **
 ** RTC
 **
 ***************************************************************************/
__IO_REG32(    RTC_ILR,                0x40046000,__WRITE      );
__IO_REG32_BIT(RTC_CCR,                0x40046008,__READ_WRITE ,__rtc_ccr_bits);
__IO_REG32_BIT(RTC_CIIR,               0x4004600C,__READ_WRITE ,__rtc_ciir_bits);
__IO_REG32_BIT(RTC_AMR,                0x40046010,__READ_WRITE ,__rtc_amr_bits);
__IO_REG32_BIT(RTC_CTIME0,             0x40046014,__READ       ,__rtc_ctime0_bits);
__IO_REG32_BIT(RTC_CTIME1,             0x40046018,__READ       ,__rtc_ctime1_bits);
__IO_REG32_BIT(RTC_CTIME2,             0x4004601C,__READ       ,__rtc_ctime2_bits);
__IO_REG32_BIT(RTC_SEC,                0x40046020,__READ_WRITE ,__rtc_sec_bits);
__IO_REG32_BIT(RTC_MIN,                0x40046024,__READ_WRITE ,__rtc_min_bits);
__IO_REG32_BIT(RTC_HRS,                0x40046028,__READ_WRITE ,__rtc_hour_bits);
__IO_REG32_BIT(RTC_DOM,                0x4004602C,__READ_WRITE ,__rtc_dom_bits);
__IO_REG32_BIT(RTC_DOW,                0x40046030,__READ_WRITE ,__rtc_dow_bits);
__IO_REG32_BIT(RTC_DOY,                0x40046034,__READ_WRITE ,__rtc_doy_bits);
__IO_REG32_BIT(RTC_MONTH,              0x40046038,__READ_WRITE ,__rtc_month_bits);
__IO_REG32_BIT(RTC_YEAR,               0x4004603C,__READ_WRITE ,__rtc_year_bits);
__IO_REG32_BIT(RTC_CALIBRATION,        0x40046040,__READ_WRITE ,__rtc_calibration_bits);
__IO_REG32_BIT(RTC_ASEC,               0x40046060,__READ_WRITE ,__rtc_sec_bits);
__IO_REG32_BIT(RTC_AMIN,               0x40046064,__READ_WRITE ,__rtc_min_bits);
__IO_REG32_BIT(RTC_AHRS,              0x40046068,__READ_WRITE ,__rtc_hour_bits);
__IO_REG32_BIT(RTC_ADOM,               0x4004606C,__READ_WRITE ,__rtc_dom_bits);
__IO_REG32_BIT(RTC_ADOW,               0x40046070,__READ_WRITE ,__rtc_dow_bits);
__IO_REG32_BIT(RTC_ADOY,               0x40046074,__READ_WRITE ,__rtc_doy_bits);
__IO_REG32_BIT(RTC_AMON,               0x40046078,__READ_WRITE ,__rtc_month_bits);
__IO_REG32_BIT(RTC_AYRS,               0x4004607C,__READ_WRITE ,__rtc_year_bits);
__IO_REG32(    REGFILE0,               0x40041000,__READ_WRITE );
__IO_REG32(    REGFILE1,               0x40041004,__READ_WRITE );
__IO_REG32(    REGFILE2,               0x40041008,__READ_WRITE );
__IO_REG32(    REGFILE3,               0x4004100C,__READ_WRITE );
__IO_REG32(    REGFILE4,               0x40041010,__READ_WRITE );
__IO_REG32(    REGFILE5,               0x40041014,__READ_WRITE );
__IO_REG32(    REGFILE6,               0x40041018,__READ_WRITE );
__IO_REG32(    REGFILE7,               0x4004101C,__READ_WRITE );
__IO_REG32(    REGFILE8,               0x40041020,__READ_WRITE );
__IO_REG32(    REGFILE9,               0x40041024,__READ_WRITE );
__IO_REG32(    REGFILE10,              0x40041028,__READ_WRITE );
__IO_REG32(    REGFILE11,              0x4004102C,__READ_WRITE );
__IO_REG32(    REGFILE12,              0x40041030,__READ_WRITE );
__IO_REG32(    REGFILE13,              0x40041034,__READ_WRITE );
__IO_REG32(    REGFILE14,              0x40041038,__READ_WRITE );
__IO_REG32(    REGFILE15,              0x4004103C,__READ_WRITE );
__IO_REG32(    REGFILE16,              0x40041040,__READ_WRITE );
__IO_REG32(    REGFILE17,              0x40041044,__READ_WRITE );
__IO_REG32(    REGFILE18,              0x40041048,__READ_WRITE );
__IO_REG32(    REGFILE19,              0x4004104C,__READ_WRITE );
__IO_REG32(    REGFILE20,              0x40041050,__READ_WRITE );
__IO_REG32(    REGFILE21,              0x40041054,__READ_WRITE );
__IO_REG32(    REGFILE22,              0x40041058,__READ_WRITE );
__IO_REG32(    REGFILE23,              0x4004105C,__READ_WRITE );
__IO_REG32(    REGFILE24,              0x40041060,__READ_WRITE );
__IO_REG32(    REGFILE25,              0x40041064,__READ_WRITE );
__IO_REG32(    REGFILE26,              0x40041068,__READ_WRITE );
__IO_REG32(    REGFILE27,              0x4004106C,__READ_WRITE );
__IO_REG32(    REGFILE28,              0x40041070,__READ_WRITE );
__IO_REG32(    REGFILE29,              0x40041074,__READ_WRITE );
__IO_REG32(    REGFILE30,              0x40041078,__READ_WRITE );
__IO_REG32(    REGFILE31,              0x4004107C,__READ_WRITE );
__IO_REG32(    REGFILE32,              0x40041080,__READ_WRITE );
__IO_REG32(    REGFILE33,              0x40041084,__READ_WRITE );
__IO_REG32(    REGFILE34,              0x40041088,__READ_WRITE );
__IO_REG32(    REGFILE35,              0x4004108C,__READ_WRITE );
__IO_REG32(    REGFILE36,              0x40041090,__READ_WRITE );
__IO_REG32(    REGFILE37,              0x40041094,__READ_WRITE );
__IO_REG32(    REGFILE38,              0x40041098,__READ_WRITE );
__IO_REG32(    REGFILE39,              0x4004109C,__READ_WRITE );
__IO_REG32(    REGFILE40,              0x400410A0,__READ_WRITE );
__IO_REG32(    REGFILE41,              0x400410A4,__READ_WRITE );
__IO_REG32(    REGFILE42,              0x400410A8,__READ_WRITE );
__IO_REG32(    REGFILE43,              0x400410AC,__READ_WRITE );
__IO_REG32(    REGFILE44,              0x400410B0,__READ_WRITE );
__IO_REG32(    REGFILE45,              0x400410B4,__READ_WRITE );
__IO_REG32(    REGFILE46,              0x400410B8,__READ_WRITE );
__IO_REG32(    REGFILE47,              0x400410BC,__READ_WRITE );
__IO_REG32(    REGFILE48,              0x400410C0,__READ_WRITE );
__IO_REG32(    REGFILE49,              0x400410C4,__READ_WRITE );
__IO_REG32(    REGFILE50,              0x400410C8,__READ_WRITE );
__IO_REG32(    REGFILE51,              0x400410CC,__READ_WRITE );
__IO_REG32(    REGFILE52,              0x400410D0,__READ_WRITE );
__IO_REG32(    REGFILE53,              0x400410D4,__READ_WRITE );
__IO_REG32(    REGFILE54,              0x400410D8,__READ_WRITE );
__IO_REG32(    REGFILE55,              0x400410DC,__READ_WRITE );
__IO_REG32(    REGFILE56,              0x400410E0,__READ_WRITE );
__IO_REG32(    REGFILE57,              0x400410E4,__READ_WRITE );
__IO_REG32(    REGFILE58,              0x400410E8,__READ_WRITE );
__IO_REG32(    REGFILE59,              0x400410EC,__READ_WRITE );
__IO_REG32(    REGFILE60,              0x400410F0,__READ_WRITE );
__IO_REG32(    REGFILE61,              0x400410F4,__READ_WRITE );
__IO_REG32(    REGFILE62,              0x400410F8,__READ_WRITE );
__IO_REG32(    REGFILE63,              0x400410FC,__READ_WRITE );

/***************************************************************************
 **
 **  UART0
 **
 ***************************************************************************/
/* U0DLL, U0RBR and U0THR share the same address */
__IO_REG32_BIT(U0RBR,                 0x40081000,__READ_WRITE  ,__uart_rbr_bits);
#define U0THR       U0RBR
#define U0THR_bit   U0RBR_bit
#define U0DLL       U0RBR
#define U0DLL_bit   U0RBR_bit
/* U0DLM and U0IER share the same address */
__IO_REG32_BIT(U0IER,                 0x40081004,__READ_WRITE ,__uart_ier_bits);
#define U0DLM      U0IER
#define U0DLM_bit  U0IER_bit
/* U0FCR and U0IIR share the same address */
__IO_REG32_BIT(U0FCR,                 0x40081008,__READ_WRITE ,__uart_fcriir_bits);
#define U0IIR      U0FCR
#define U0IIR_bit  U0FCR_bit

