una1veritas/Workspace/STM32-E_revB1_demo/Project/Test/arm/inc/NXP/iolpc4320_m0.h
/***************************************************************************
 **
 ** D/A Converter
 **
 ***************************************************************************/
__IO_REG32_BIT(DAC_CR,                  0x400E1000,__READ_WRITE ,__dac_cr_bits);
__IO_REG32_BIT(DAC_CTRL,                0x400E1004,__READ_WRITE ,__dac_ctrl_bits);
__IO_REG32_BIT(DAC_CNTVAL,              0x400E1008,__READ_WRITE ,__dac_cntval_bits);

/***************************************************************************
 **  Assembler-specific declarations
 ***************************************************************************/

#ifdef __IAR_SYSTEMS_ASM__
#endif    /* __IAR_SYSTEMS_ASM__ */

/***************************************************************************
 **
 **  GPDMA Controller peripheral devices lines
 **
 ***************************************************************************/
#define GPDMA_SPIFI             0   /* SPIFI                                   */
#define GPDMA_SCTMATCH2         0   /* SCT Match 2                             */
#define GPDMA_SGPIO14           0   /* SGPIO14                                 */
#define GPDMA_T0MATCH0          1   /* Timer 0 match 0                         */
#define GPDMA_UART0TX           1   /* UART0 transmit                          */
#define GPDMA_AESIN             1   /* AES input                               */
#define GPDMA_T0MATCH1          2   /* Timer 0 match 1                         */
#define GPDMA_UART0RX           2   /* UART0 receive                           */
#define GPDMA_AESOUT            2   /* AES output                              */
#define GPDMA_T1MATCH0          3   /* Timer 1 match 0                         */
#define GPDMA_UART1TX           3   /* UART1 transmit                          */
#define GPDMA_I2S1DMA0          3   /* I2S1 DMA req 0                          */
#define GPDMA_T1MATCH1          4   /* Timer 1 match 1                         */
#define GPDMA_UART1RX           4   /* UART1 receive                           */
#define GPDMA_I2S1DMA1          4   /* I2S1 DMA req 1                          */
#define GPDMA_T2MATCH0          5   /* Timer 2 match 0                         */
#define GPDMA_UART2TX           5   /* UART2 transmit                          */
#define GPDMA_T2MATCH1          6   /* Timer 2 match 1                         */
#define GPDMA_UART2RX           6   /* UART2 receive                           */
#define GPDMA_T3MATCH0          7   /* Timer 3 match 0                         */
#define GPDMA_UART3TX           7   /* UART3 transmit                          */
#define GPDMA_SCTDMA0           7   /* SCT DMA request 0                       */
#define GPDMA_VADCWR            7   /* VADC write                              */
#define GPDMA_T3MATCH1          8   /* Timer 3 match 1                         */
#define GPDMA_UART3RX           8   /* UART3 receive                           */
#define GPDMA_VADCRD            8   /* VADC read                               */
#define GPDMA_SSP0RX            9   /* SSP0 receive                            */
#define GPDMA_I2S0DMA0          9   /* I2S DMA request 0                       */
#define GPDMA_SCTDMA1           9   /* SCT DMA request 1                       */
#define GPDMA_SSP0TX           10   /* SSP0 transmit                           */
#define GPDMA_I2S0DMA1         10   /* I2S channel 1                           */
#define GPDMA_SCTMATCH0        10   /* SCT match 0                             */
#define GPDMA_SSP1RX           11   /* SSP1 receive                            */
#define GPDMA_SSP1TX           12   /* SSP1 transmit                           */
#define GPDMA_SGPIO15          12   /* SGPIO15                                 */
#define GPDMA_ADC0             13   /* ADC0                                    */
#define GPDMA_ADC1             14   /* ADC1                                    */
#define GPDMA_DAC              15   /* DAC                                     */

/***************************************************************************
 **
 **  NVIC M0 Interrupt channels
 **
 ***************************************************************************/
#define MAIN_STACK                   0  /* Main Stack                                             */
#define RESETI                       1  /* Reset                                                  */
#define NMII                         2  /* Non-maskable Interrupt                                 */
#define HFI                          3  /* Hard Fault                                             */
#define MMI                          4  /* Memory Management                                      */
#define BFI                          5  /* Bus Fault                                              */
#define UFI                          6  /* Usage Fault                                            */
#define SVCI                        11  /* SVCall                                                 */
#define DMI                         12  /* Debug Monitor                                          */
#define PSI                         14  /* PendSV                                                 */
#define STI                         15  /* SysTick                                                */
#define NVIC_M0_RTC                 16
#define NVIC_M0_M4CORE              17
#define NVIC_M0_DMA                 18
#define NVIC_M0_SDIO                22
#define NVIC_M0_USB0                24
#define NVIC_M0_SCT                 26
#define NVIC_M0_RITIMER_OR_WWDT     27
#define NVIC_M0_TIMER0              28
#define NVIC_M0_GINT1               29
#define NVIC_M0_PIN_INT4            30
#define NVIC_M0_TIMER3              31
#define NVIC_M0_MCPWM               32
#define NVIC_M0_ADC0                33
#define NVIC_M0_I2C0_OR_I2C1        34
#define NVIC_M0_SGPIO               35
#define NVIC_M0_SPI_OR_DAC          36
#define NVIC_M0_ADC1                37
#define NVIC_M0_SSP0_OR_SSP1        38
#define NVIC_M0_EVENTROUTER         39
#define NVIC_M0_USART0              40
#define NVIC_M0_UART1               41
#define NVIC_M0_USART2_OR_C_CAN1    42
#define NVIC_M0_USART3              43
#define NVIC_M0_I2S0_OR_I2S1			  44
#define NVIC_M0_C_CAN0              45

/***************************************************************************
 **
 **  EVR Interrupt channels
 **
 ***************************************************************************/
#define EVR_WAKEUP0           0
#define EVR_WAKEUP1           1
#define EVR_WAKEUP2           2
#define EVR_WAKEUP3           3
#define EVR_ATIMER            4
#define EVR_RTC               5
#define EVR_BOD               6
#define EVR_WWDT              7
#define EVR_USB0              9
#define EVR_SDIO              11
#define EVR_C_CAN             12
#define EVR_TIMER2            13
#define EVR_TIMER6            14
#define EVR_TIMER14           16
#define EVR_RESET             19

/***************************************************************************
 **
 **  Power Down Modes
 **
 ***************************************************************************/

